{
    "fried_liver": {
        "description": "The Fried Liver, a variation of the Two Knights Defense is an opening that sacrifices a knight for a attack on Black's King and offers plenty of aggressive options. Both players move their king pawn two squares (e4 e5) and bring out their (white) f and (black) c knights. White proceeds with Bc4 and black responds with Nf6. From this position, white can now enter the Fried Liver attack by moving their knight from f3 to g5 and attacking the pawn on f7. If black didn’t move their knight to f6, then white’s knight would be captured by the queen. Black can defend with their queen’s pawn to d5. This blocks the bishop and attacks it. However, when white captures the queen's pawn with ed5, and black recaptures with their knight from f6, white can use the g5 knight as a sacrifice for the pawn. Reason being that when the black king captures, white can go qf3 to check and recapture the black knight in the center. ",
        "whiteSeq": ["e4","Nf3","Bc4","Ng5","exd5","Nxf7","Bxd5+"],
        "blackSeq": ["e5","Nc6","Nf6","d5","Nxd5","Kxf7"]
    },
    "traxler_counter": {
        "description": "The Traxler Counter Attack is a variation of the Fried Liver Attack where black sacrifices their pawn under attack to gain momentum and launch an attack of their own. From the fried liver position, you will sacrifice your bishop to capture the pawn on f2 and deliver a check. In the situation where white captures the bishop, you can continue the attack with Nfe4. From that position, you will play Qf6 and check the white king. The white king can capture the knight of move out of it. If the knight is captured, you can break the center open with d5. White doesn’t have to take your bishop and can sidestep the check, a critical move. Black can move the queen out of the way of the knight (Qe7). Black will sacrifice the rook on the h file and strike back in the center with d5. This move intends to set up Bcg4, trapping the enemy queen. ",
        "whiteSeq": ["e4","Nf3","Bc4","Ng5","Nxf7","Kxf2","Ke3"],
        "blackSeq": ["e5","Nc6","Nf6","Bc5","Bxf2+","Nxe4+","Qh4"]
    }
    
}